package com.gaoyun.yanyou_kototomo.data.local.card

object KanaLists {
    val gojuonKana = listOf(
        "あ", "い", "う", "え", "お", // A-row
        "か", "き", "く", "け", "こ", // K-row
        "さ", "し", "す", "せ", "そ", // S-row
        "た", "ち", "つ", "て", "と", // T-row
        "な", "に", "ぬ", "ね", "の", // N-row
        "は", "ひ", "ふ", "へ", "ほ", // H-row
        "ま", "み", "む", "め", "も", // M-row
        "や", "ゆ", "よ",             // Y-row
        "ら", "り", "る", "れ", "ろ", // R-row
        "わ", "を", "ん"              // W-row and N
    )

    val dakuonHandakuonKana = listOf(
        "が", "ぎ", "ぐ", "げ", "ご", // G-row
        "ざ", "じ", "ず", "ぜ", "ぞ", // Z-row
        "だ", "ぢ", "づ", "で", "ど", // D-row
        "ば", "び", "ぶ", "べ", "ぼ", // B-row
        "ぱ", "ぴ", "ぷ", "ぺ", "ぽ"  // P-row
    )

    val yoonKana = listOf(
        "きゃ", "きゅ", "きょ", // K-row
        "しゃ", "しゅ", "しょ", // S-row
        "ちゃ", "ちゅ", "ちょ", // T-row
        "にゃ", "にゅ", "にょ", // N-row
        "ひゃ", "ひゅ", "ひょ", // H-row
        "みゃ", "みゅ", "みょ", // M-row
        "りゃ", "りゅ", "りょ", // R-row
        "ぎゃ", "ぎゅ", "ぎょ", // G-row
        "じゃ", "じゅ", "じょ", // J-row
        "びゃ", "びゅ", "びょ", // B-row
        "ぴゃ", "ぴゅ", "ぴょ"  // P-row
    )
}