object KanaLists {
    val gojuonKana = listOf(
        // Hiragana
        "あ", "い", "う", "え", "お", // A-row
        "か", "き", "く", "け", "こ", // K-row
        "さ", "し", "す", "せ", "そ", // S-row
        "た", "ち", "つ", "て", "と", // T-row
        "な", "に", "ぬ", "ね", "の", // N-row
        "は", "ひ", "ふ", "へ", "ほ", // H-row
        "ま", "み", "む", "め", "も", // M-row
        "や", "ゆ", "よ",             // Y-row
        "ら", "り", "る", "れ", "ろ", // R-row
        "わ", "を", "ん",             // W-row and N
        // Katakana
        "ア", "イ", "ウ", "エ", "オ", // A-row
        "カ", "キ", "ク", "ケ", "コ", // K-row
        "サ", "シ", "ス", "セ", "ソ", // S-row
        "タ", "チ", "ツ", "テ", "ト", // T-row
        "ナ", "ニ", "ヌ", "ネ", "ノ", // N-row
        "ハ", "ヒ", "フ", "ヘ", "ホ", // H-row
        "マ", "ミ", "ム", "メ", "モ", // M-row
        "ヤ", "ユ", "ヨ",             // Y-row
        "ラ", "リ", "ル", "レ", "ロ", // R-row
        "ワ", "ヲ", "ン"              // W-row and N
    )

    val dakuonHandakuonKana = listOf(
        // Hiragana
        "が", "ぎ", "ぐ", "げ", "ご", // G-row
        "ざ", "じ", "ず", "ぜ", "ぞ", // Z-row
        "だ", "ぢ", "づ", "で", "ど", // D-row
        "ば", "び", "ぶ", "べ", "ぼ", // B-row
        "ぱ", "ぴ", "ぷ", "ぺ", "ぽ", // P-row
        // Katakana
        "ガ", "ギ", "グ", "ゲ", "ゴ", // G-row
        "ザ", "ジ", "ズ", "ゼ", "ゾ", // Z-row
        "ダ", "ヂ", "ヅ", "デ", "ド", // D-row
        "バ", "ビ", "ブ", "ベ", "ボ", // B-row
        "パ", "ピ", "プ", "ペ", "ポ"  // P-row
    )

    val yoonKana = listOf(
        // Hiragana
        "きゃ", "きゅ", "きょ", // K-row
        "しゃ", "しゅ", "しょ", // S-row
        "ちゃ", "ちゅ", "ちょ", // T-row
        "にゃ", "にゅ", "にょ", // N-row
        "ひゃ", "ひゅ", "ひょ", // H-row
        "みゃ", "みゅ", "みょ", // M-row
        "りゃ", "りゅ", "りょ", // R-row
        "ぎゃ", "ぎゅ", "ぎょ", // G-row
        "じゃ", "じゅ", "じょ", // J-row
        "びゃ", "びゅ", "びょ", // B-row
        "ぴゃ", "ぴゅ", "ぴょ", // P-row
        // Katakana
        "キャ", "キュ", "キョ", // K-row
        "シャ", "シュ", "ショ", // S-row
        "チャ", "チュ", "チョ", // T-row
        "ニャ", "ニュ", "ニョ", // N-row
        "ヒャ", "ヒュ", "ヒョ", // H-row
        "ミャ", "ミュ", "ミョ", // M-row
        "リャ", "リュ", "リョ", // R-row
        "ギャ", "ギュ", "ギョ", // G-row
        "ジャ", "ジュ", "ジョ", // J-row
        "ビャ", "ビュ", "ビョ", // B-row
        "ピャ", "ピュ", "ピョ"  // P-row
    )
}