{
  "languages": [
    {
      "id": "cn",
      "source_languages": [
        {
          "source_language": "en",
          "courses": [
            {
              "id": "hsk1_en",
              "course_name": "HSK1",
              "preview": "你 谢谢 好 我 很 是 再见 人 中国 高兴 吗 吃 错 有 猫 女 儿子 六 爸 妈 的 水 火 钱 菜 学 生 朋友 电影 东西 鱼 音 乐 字 车 站 蛋糕 办公室",
              "decks": [
                {
                  "type": "normal",
                  "id": "hsk1_1_en",
                  "name": "HSK1 Chapter 1",
                  "version": 1,
                  "deck_preview": "对不起 二 没关系 你 好 六 你好 三 十 八"
                },
                {
                  "type": "normal",
                  "id": "hsk1_2_en",
                  "name": "HSK1 Chapter 2",
                  "version": 1,
                  "deck_preview": "不谢 谢谢 不客气 再见 不"
                },
                {
                  "type": "normal",
                  "id": "hsk1_3_en",
                  "name": "HSK1 Chapter 3",
                  "version": 1,
                  "deck_preview": "叫 吗 老师 人 什么 名字 我 学生 是 中国"
                },
                {
                  "type": "normal",
                  "id": "hsk1_4_en",
                  "name": "HSK1 Chapter 4",
                  "version": 1,
                  "deck_preview": "的 七 汉语 朋友 呢 哪 九 同学 他 她"
                },
                {
                  "type": "normal",
                  "id": "hsk1_5_en",
                  "name": "HSK1 Chapter 5",
                  "version": 1,
                  "deck_preview": "大 女儿 了 多 家 几 年 岁 有 口"
                },
                {
                  "type": "normal",
                  "id": "hsk1_6_en",
                  "name": "HSK1 Chapter 6",
                  "version": 1,
                  "deck_preview": "很 读 菜 写 说话 会 怎么 妈妈 做 汉字"
                },
                {
                  "type": "normal",
                  "id": "hsk1_7_en",
                  "name": "HSK1 Chapter 7",
                  "version": 1,
                  "deck_preview": "今天 请 明天 看 去 书 五 四 星期 月"
                },
                {
                  "type": "normal",
                  "id": "hsk1_8_en",
                  "name": "HSK1 Chapter 8",
                  "version": 1,
                  "deck_preview": "茶 吃 杯子 买 个 块 多少 喝 米饭 这"
                },
                {
                  "type": "normal",
                  "id": "hsk1_9_en",
                  "name": "HSK1 Chapter 9",
                  "version": 1,
                  "deck_preview": "爸爸 儿子 工作 猫 狗 椅子 小 医生 医院 下"
                },
                {
                  "type": "normal",
                  "id": "hsk1_10_en",
                  "name": "HSK1 Chapter 10",
                  "version": 1,
                  "deck_preview": "电脑 本 后面 里 和 能 前面 没 电 上"
                },
                {
                  "type": "normal",
                  "id": "hsk1_11_en",
                  "name": "HSK1 Chapter 11",
                  "version": 1,
                  "deck_preview": "北京 电影 分钟 点 回 零 现在 我们 时候 前"
                },
                {
                  "type": "normal",
                  "id": "hsk1_12_en",
                  "name": "HSK1 Chapter 12",
                  "version": 1,
                  "deck_preview": "来 爱 热 冷 水果 水 太 天气 太 … 了 下"
                },
                {
                  "type": "normal",
                  "id": "hsk1_13_en",
                  "name": "HSK1 Chapter 13",
                  "version": 1,
                  "deck_preview": "打电话 日 电视 上午 睡觉 喂 学校 也 喜欢"
                },
                {
                  "type": "normal",
                  "id": "hsk1_14_en",
                  "name": "HSK1 Chapter 14",
                  "version": 1,
                  "deck_preview": "东西 都 开 漂亮 衣服 苹果 先生 少 看见 啊"
                },
                {
                  "type": "normal",
                  "id": "hsk1_15_en",
                  "name": "HSK1 Chapter 15",
                  "version": 1,
                  "deck_preview": "出租车 认识 饭馆 飞机 听 车 高兴 一起 大学 饭店"
                }
              ]
            },
            {
              "id": "hsk2_en",
              "course_name": "HSK2",
              "preview": "学生 饭店 朋友 请 教室 机场 电视 号码 热 吃饭 高兴 运动 计划 颜色 火车 天气 大家 电话 商店 外面 走路 电影 开始 周末 都 市场 认识 说话",
              "decks": [
                {
                  "type": "normal",
                  "id": "hsk2_1_en",
                  "name": "HSK2 Chapter 1",
                  "version": 1,
                  "deck_preview": "旅游 眼睛 运动 踢足球 也"
                },
                {
                  "type": "normal",
                  "id": "hsk2_2_en",
                  "name": "HSK2 Chapter 2",
                  "version": 1,
                  "deck_preview": "跑步 时间 生病 身体 药"
                },
                {
                  "type": "normal",
                  "id": "hsk2_3_en",
                  "name": "HSK2 Chapter 3",
                  "version": 1,
                  "deck_preview": "报纸 房间 旁边 牛奶 右边"
                },
                {
                  "type": "normal",
                  "id": "hsk2_4_en",
                  "name": "HSK2 Chapter 4",
                  "version": 1,
                  "deck_preview": "问 非常 已经 两 介绍"
                },
                {
                  "type": "normal",
                  "id": "hsk2_5_en",
                  "name": "HSK2 Chapter 5",
                  "version": 1,
                  "deck_preview": "考试 咖啡 外面 以后 意思"
                },
                {
                  "type": "normal",
                  "id": "hsk2_6_en",
                  "name": "HSK2 Chapter 6",
                  "version": 1,
                  "deck_preview": "姐姐 打篮球 羊肉 门 面条"
                },
                {
                  "type": "normal",
                  "id": "hsk2_7_en",
                  "name": "HSK2 Chapter 7",
                  "version": 1,
                  "deck_preview": "公共汽车 公司 机场 路 教室"
                },
                {
                  "type": "normal",
                  "id": "hsk2_8_en",
                  "name": "HSK2 Chapter 8",
                  "version": 1,
                  "deck_preview": "服务员 事情 再 告诉 让"
                },
                {
                  "type": "normal",
                  "id": "hsk2_9_en",
                  "name": "HSK2 Chapter 9",
                  "version": 1,
                  "deck_preview": "问题 题 第一 欢迎 懂"
                },
                {
                  "type": "normal",
                  "id": "hsk2_10_en",
                  "name": "HSK2 Chapter 10",
                  "version": 1,
                  "deck_preview": "鸡蛋 哥哥 手机 西瓜 课"
                },
                {
                  "type": "normal",
                  "id": "hsk2_11_en",
                  "name": "HSK2 Chapter 11",
                  "version": 1,
                  "deck_preview": "男人 唱歌 女人 孩子 可能"
                },
                {
                  "type": "normal",
                  "id": "hsk2_12_en",
                  "name": "HSK2 Chapter 12",
                  "version": 1,
                  "deck_preview": "弟弟 度 雪 妻子 穿"
                },
                {
                  "type": "normal",
                  "id": "hsk2_13_en",
                  "name": "HSK2 Chapter 13",
                  "version": 1,
                  "deck_preview": "手 铅笔 宾馆 斑 路"
                },
                {
                  "type": "normal",
                  "id": "hsk2_14_en",
                  "name": "HSK2 Chapter 14",
                  "version": 1,
                  "deck_preview": "百 玩儿 晴 有意思 次"
                },
                {
                  "type": "normal",
                  "id": "hsk2_15_en",
                  "name": "HSK2 Chapter 15",
                  "version": 1,
                  "deck_preview": "大家 火车站 妹妹 票 更"
                }
              ]
            },
            {
              "id": "hsk3_en",
              "course_name": "HSK3",
              "preview": "问题 出租车 机会 公司 高速公路 飞机 旅馆 司机 汉字 锻炼 干净 空气 安全 销售 市场 电影院 礼物 火车站 流行 发展 音乐 会话 小孩 旅游 热情 小心 吃的 各种 生活",
              "decks": [
                {
                  "type": "normal",
                  "id": "hsk3_1_en",
                  "name": "HSK3 Chapter 1",
                  "version": 1,
                  "deck_preview": "问题 出租车 机会 公司 高速公路"
                }
              ]
            },
            {
              "id": "hsk4_en",
              "course_name": "HSK4",
              "preview": "中文 习惯 社会 电视 变化 机会 会议 讨论 计划 条件 努力 礼貌 经验 知识 采访 健康 增长 高速 公路 环境 实习 目标 职业 不错 考试 听力 科技 正确",
              "decks": [
                {
                  "type": "normal",
                  "id": "hsk4_1_en",
                  "name": "HSK4 Chapter 1",
                  "version": 1,
                  "deck_preview": "中文 习惯 社会 电视 变化"
                }
              ]
            },
            {
              "id": "hsk5_en",
              "course_name": "HSK5",
              "preview": "政治 文化 经验 会议 经济 职业 社会 影响 竞争 发展 课堂 数字 知识 写作 计算机 科技 未来 企业 关系 改革 产品 教育 合作 新闻 设计 数量 航空 现代 生活 传统 价值",
              "decks": [
                {
                  "type": "normal",
                  "id": "hsk5_1_en",
                  "name": "HSK5 Chapter 1",
                  "version": 1,
                  "deck_preview": "政治 文化 经验 会议 经济"
                }
              ]
            },
            {
              "id": "hsk6_en",
              "course_name": "HSK6",
              "preview": "广告 文化 经济 人权 法律 学术 技术 社会 政府 环境 创新 研究 成功 挑战 思考 教训 合作 民主 政策 国际 影响 学者 理论 机会 现代 科技 进步 情况 生活 传统",
              "decks": [
                {
                  "type": "normal",
                  "id": "hsk6_1_en",
                  "name": "HSK6 Chapter 1",
                  "version": 1,
                  "deck_preview": "广告 文化 经济 人权 法律"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "jp",
      "source_languages": [
        {
          "source_language": "en",
          "courses": [
            {
              "id": "kana_en",
              "course_name": "Kana",
              "preview": "あ イ い ツ き フ げ タ す サ そ コ ご し オ お ピ ひ ヰ ン こ で の ギ ま ゴ や ら ま わ た さ な は ま み め も よ り",
              "required_decks": [
                "hiragana_en",
                "katakana_en"
              ],
              "decks": [
                {
                  "type": "alphabet",
                  "id": "hiragana_en",
                  "alphabet": "hiragana",
                  "name": "Hiragana",
                  "version": 1,
                  "deck_preview": "あ か さ ん た と つ は ひ ほ み も や ゆ ら り ろ れ そ く こ む め ふ け き お い て ね の "
                },
                {
                  "type": "alphabet",
                  "id": "hiragana_1_en",
                  "alphabet": "hiragana",
                  "name": "Hiragana vowels, k-line",
                  "version": 1,
                  "deck_preview": "あ い う え お か き く け こ が ぎ ぐ げ ご"
                },
                {
                  "type": "alphabet",
                  "id": "katakana_en",
                  "alphabet": "katakana",
                  "name": "Katakana",
                  "version": 1,
                  "deck_preview": "ア カ サ ン タ ト ツ ハ ヒ ホ ミ モ ヤ ユ ラ リ ロ レ ソ ク コ ム メ フ ケ キ オ イ テ ネ ノ "
                }
              ]
            },
            {
              "id": "genki1_en",
              "course_name": "Genki vol. 1",
              "preview": "くだもの ゆうのうな ひとつ かようび うまれる あと かえり ペン はちまん かいしゃいん のみもの きいてください。 させつ ここのか おかあさん くび けんきゅうしゃ おおきい じゅうろくにち くろい ほんや ゲーム しぬ すし かぜ にちようび かんこく した せいけいげか じゅう／とお つくえ みかん えきいん ちゅうきんとう ようか ちち とうよう にく おかず まいあさ アジアけんきゅう ていねいないいかた ～じ きいろい まち さんじゅうごさい けいざい かふんしょうです。 じゅうくにち にじ もくじ そこ あおい まだ じかん はは ちゅうがく きこく すずしい へた(な) さらいしゅう きんようび おとこのこ していせき ひと べんきょうする にしゅうかんまえ カナダ ちゅうがっこう むいか さいごに なつ ただしい うし かっこ きょうかい じゅうびょう にし そうちょう とおか あるいて がんじつ まいばん ひだりにまがる にじゅうににち てんぷら だれ くるまいす まど よっか しりつだいがく しちじ でんち ななつ でかける いっしょに おだいじに じぶん きゅうびょう びょういん せんげつ かぞく じゅうにがつ じゅうにん に はっせん みどりのセーター／グリーンのセーター はいる おがわさん いす どんな ごじ ～と がっこう きんいろ／--- わかりましたか。 げつようび しやくしょ わかい えいが しんかんせん どくしょ うみ こんや もも そうじする つける かりる まあまあ ゆにゅう ～ほうめん ビジネス 10ページをみてください。 あとで はじめる ぎんこう どちらでもいいです。 すぐ かいしゃ ばんごう いそがしい しめきり ばんごはん ななまん ごふん いちばん ろうどう じゅうじ ねむい とき ほかに あし ～おめでとう（ございます）。 ごうじょうな にじゅうよっか たばこをすう むね しゅっせき つゆ でんき おこす ちかてつ すいえい つかえる とし はたち／にじ(ゅ)っさい ピンク ホームシック さきに もつ じてんしゃ きんじょ ぶんぽう おみやげ えん つめたい はっしんがあります。 ぎんいろ／--- しょうらい おそい きのう くだけたいいかた いち ご じゅっさい／じっさい ひとりたび さんじ あそこ せかい ろく ぜひ これ せつめい はれ どうやって ふつかかん せんぱい こんいろ でぐち ギター メニュー ろくまん だいがく ぼご いちぎょうめ ゆうじん せんぱつ （～に）アレルギーがあります。 きゅうまん やすい ～てん いろいろなところ がくわり おあいできるをたのしみにしています。 きょうだい あき にねんせい じゅぎょう くるま さいふ えき これはハラルフードですか。 はつか しりつこうこう いしゃ よんせん にさんにち もの けいご にまん こうい もらう おなかがすく せんせい てをあげてください。 しんせつ もっていく じどうはんばいき なる あまい はっぴゃく わすれる ええ ここ とち くもり しゅうまつ しんとう じゅうよっか あめがふる にじゅうはちにち りゅうがくする しか／はいしゃ みっつ さんじゅういちにち ～ごろ ひふか のりかえ ごぜんちゅう オレンジ となり かんごし ぎゅうにゅう あめ ピーナッツアレルギーがあります。 はん じょせい こと しょうがっこう ねる アメリカ あいだ さんにん にさい ひゃくえん よっつ くしゃみがでます。 ぶんか でんしゃがまいります。 みる せいじ くすり たいど いらっしゃいませ くじ とくしょく てんき かた りょこうする つかれる げんきがない よやく ～しゅうかん じゅうしちにち よんひゃく おんど ～について にがつ だいじょうぶ おかね すいか びよういん しんぱいする じゅうまん かしゅ となりのひとにきいてください。 ～ばんせん やまかわさん パソコン せいかつ よじ みぎて カメラ ながい ひとりで こくれん パン てぶくろ おてあらい にっき おんがく ぜんぜん りょこう ななひゃく よみもの はたらく ふぼ じんこう かおがあおいですね。 いっさい おなじ しょうぼうし テニス スープ あつい まなぶ ざんねん(ですね) ごめんなさい いちじはん みみ おくじょう みそしる おもちゃ きこえる それから よあけ やすむ じんじゃ あたまがいい にじゅうしちにち おまつり すわる うたう しけん トースト がいこく じゅうがつ ふつか はなし つぎは～にとまります。 ～ご きゅうひゃく ううん べんり(な) ちかく つれてくる もじ ひさしぶり めまいがします。 さんじ(ゅ)っぷん ばいてん すきな おかねもち じかい あおぞら りんご いる パスタ にしぐち かいわ じしょ ゆきがふる みぎがわ けしき わるい かかる にじかん りょうりする スポーツせんしゅ きゅうじつ フィリピン だから あね ちょうなん くる でも ～か～ うそをつく よねんせい にもつ かいさつ ひだりて アレルギー じゅうしょ みぎにまがる かんたん（な） ベージュ れんきゅう りょけん とりにく そうですか ごひゃく いく うえ どの かんぱい がくぶ がんか／めいしゃ おなじです。 いえ ひま（な） こわい だいどころ どこ さんまん おばあさん きゅうこう こうえん みずうみ つり しかえし たんご じゅうどう アボカドはありますか。 かない ルームメート いつ ぶんめい ごがつ とうきょうまでのしていせきをいちまいおねがいします。 とうきょう ～ぐらい どようび レストラン かんとう だんせい けっこんする かう うる ふるい ひだり き せいねん あかるい はい にんじん すむ こうがく むっつ いぬ アイスクリーム ピザ みじかい すいどう きく もしもし ～のあと じゃあ きょうと かし きおん ひるごはん テレビ けさ おりる きゅうにん ゆき たかい ふゆ はちにん 10ページをひらいてください。 かえる ちょっとちがいます。 うんてんする かっこいい ～えん たまねぎ やさしい はく にんきがある うん ふたり がいこくじん せまい かお ひゃくまん こたえ こうつうけいICかーど ドライブ びょうき いつか ごせん いんしゅうんてん ろくがつ ごまん しようちゅう ぎゅうにく やっつ きょうつうご へたな エアコン プレゼント ちゅうごく サボる しりあい さんじゅうど ぶんがく こうし しょくぎょう つぎは～ このでんしゃはあきはばらにとまりますか。 ある しりません きゅう ～が おふろにはいる あさ やせています とんかつ みずぎ じゃがいも じ(ゅ)っぷん めがね かいだん いろいろおせわになりました。 きんちょうする じゅうはっぷん／じゅうはちふん いちど め なまえ ホストファミリー さいきどう ～さい こっかい きょうかしょ れんしゅう じどうしゃ さんびゃく こうこうせい きもち にゅうしゃ だいすきな きょねん よん てんきよほう しろい かぜをひく わかりました。 べつに でる ～じん りょうり きょうこ さんぽする て ひく こんばん ごさい なんとう どうも ほくせい かせい せきがでる せきじゅうじ ぼく たんじょうび あらう えんぴつ ゆっくり まいねん／まいとし ～だけ むずかしい としょかん あたたかい いちじかん きょう わける しゅうでん よんじ(ゅ)っさい はっさい まる はっぷん／はちふん じゅっぷん／じっぷん しゅわ おねえさん みずいろ さびしい おきる ざっし さんじはん こんげつ コンサート ふつかよい そと けがをしました。 かいもの てんのう えいがかん ふとる うんどうする このなかにおさけがはいっていますか。 そふ れきし キャベツ じゅういっぷん らいしゅう よんできてください。 だす おとうと おこのみやき にじ(ゅ)っぷん こうぶつ ふね いろ しゅくだい かみ きます まえうり わかりません。 コンピューター いっぷん はいいろ／--- じゆうせき じょうきょうする むかしばなし げんきな さべつ Tシャツ もってくる いれる はやい たなかさん かのじょ うどん しる にじゅういっさい たくさん まもなくはっしゃします。 けんかする はきました。 シャワー さかな バス しめい じょうずな さんぷん どうですか きめる こない にほん ひがしぐち じゅうさんにち エルサイズ いちねんじゅう このひと ～ど にじゅうごにち サンドイッチ いちば なくす れい じゅうさんぷん スキー しゅふ ろくじ とっきゅう しちがつ けす つれてかえる わたし かわぐちし おつかい じじょ うつる やすみ おぼえる ことば みちをわたる しんせつ(な) つよい きたやまちょう うた のどがかわく それ さゆう にじゅうろくにち （お）たんじょうびおめでとう。 ところ スーパー はしる おそくなる イギリス はくちょう しゅくだいをだしてください。 ホテル かわ こくさいかんけい はる ノート ちこくする バスてい むかしむかし せき らいがっき じゅうはちにち しょうねん インド きょうはこれでおわります。 ゆめ きっぷうりば しゅうでんはなんじですか。 さむい みんなで ともばたらき すごく しごと わし しんゆう ごにん じゅうごにち くすりをのむ うしろ なのか しつもん たいてい だいがくいん いつつ みょうじ いろいろな だいがくいんせい じゅういちじ きゅうふん はやおきする ちゃいろい とまる げんき（な） しっています たべる いくら ちょうしょく きんべんな なに みどり／--- ふとっています つくる こうちゃ おそく まいにち ハンバーグ みぎ かく おおい にふん コンビニ わかれる どっち／どちら ふたりずつ あしをこっせつしました。 ほん みちをきく おととし バイト いいこ むかし くに かぶき にほんじん ななせん はなび どうして ついたち ばつ ごはん デパート せいせき みなみ おどる はんぶん チケット いもうと カレーライス は もくようび ひとびと なんきょく はなみ つかえません。 さらいげつ おおあめ うせつ じゅうきゅうふん コーヒー つかう たとえば ひがし さいきん テスト ゆっくりいってください。 じゅうごふん さくぶん どのぐらい かたみち よる ゆきだるま ならう なんにん きらい（な） しめる せんこう にひゃく よにん てんてき のど おかし よんまん べんごし ヨーグルト はち ごご あした おととい ていきけん よんさい ひゃく しち／なな カレー じゆう そうです てんさい スポーツ しあい ろくせん いみ おもいだす ～だい ひろい ちゅうしゃじょう こうこう おとこのひと じょうず(な) くち いちねんせい みんな サークル やさい にほんご にじゅうくにち いう ねんど じゅういちがつ じょうしゃけん ジーンズ レントゲン きょうみがある のる さっか あかい せいかい ろっぴゃく あたま それに げりです。 おとな ろくねんせい だいたいおなじです。 ～さん ひこうき たいし いたい ほっかいどう カーテン あれ たべもの もういちどいってください。 じ(ゅ)っさい とくべつな でんしゃ おりがみ まえ どれ ぼうし あおしんごう はじまる びじゅつかん とお ばいばい かんさい ところで たのしい こちら げんごがく さん しょうかいする かばん ひ つとめる いっしゅうかん ～で おとうさん ごぜん おわる ほんとうですか だいきらい（な） ようび ほうげん トマト ここのつ さしみ ～ねん ちょっとまってください。 しょうしょう かれし ちょっと ろくにん サラダ いい なか じゅうにじ よむ さんがつ はんがく ゆうめいじん せいよう ふつう このみ てんごく たまご でんわ うち ミルク ページ しちょう じゅうよんぷん すてき（な） じびか とる かみさま しゅじゅつ にんげん もう せんたくする ななさい だんしがくせい だめです。 こどものとき よなか いそぐ はんとし ふくろをおねがいします。 あるく だいすき（な） しょうじょ できるだけ そうですね まっすぐいく とても こうせいぶっしつ おなか あなた くつ あそぶ いちご はなみずがでます。 こくばん まいしゅう ドアがしまります。ごちゅういください。 こっか てつだう ゆび ろっぷん きれい（な） はちがつ きゅうさい もっと ななにん／しちにん そば せなかがかゆいです。 からだにきをつけてください。 なにか けいさつかん なん／なに たつ あかがいちばん好きです。 がくわりがつかえますか。 なす たいしかん きっぷ まんが とうなんアジア かざん しょうがくせい がくせい はらう いけん きぶんがわるいです。 ろくさい しんせんな しろ ぎょうざ すこし ひだりきき やきゅう しょくどう みち えいご じもと このごろ しゃちょう ホーム とうほく ピアノ しずか（な） よかったら おさけ にじゅういちにち そぼ きょうかしょをとじてください。 さくひん ことし おふろ やめる インフルエンザ ふじさん あかいかばん ～いき おんなのひと じゅうにふん ダイエットする しんぶん カラオケ げか ゆうめい(な) サーフィン やせる やま らいげつ こんがっき けしゴム かさ おもう おにいさん さんふじんか ～ねんせい ぎゅうどん がか らいねん ホームステイ ちょうじょ はつおん てんいん さんぜん ～かげつ いじゅうする さくしゃ レポート ～まで べんぴです。 せんえん べつべつに ごうとう いちまん ぶどう ねつがある おしえる はなす わかる よく まるい コーラ せんしゅう おべんとう あさって その けんぶつ ゆうじょう つぎ てがみ キャンプ はし むらさき じゅうろっぷん ちょうちょう デート みなみぐち しゃしん おしり きた ななふん すき（な） のぼる かんじ ゆうりょう いっしょうにいちど れんしゅうする ケーキ しちにん／ななにん ～から しょうご きむらさん きせつ でんわする よんぷん きたく ちゅうこ やまもとさん めいし ハンバーガー ～じかん (めがねを)かける かわいい ジュース ひとり オーストラリア こだい ともだち じょしがくせい おうふく ゆしゅつ こうべし ごねんせい バーベキュー どうぶつえん ～にん さんさい まんがか はな いちがつ えんだか ほっきょく ツアー むしばがあります。 ふたつ りょかん ふく こんしゅう さんねんせい はちじ アルバイト やけどをしました。 みず およぐ ゆうめいな じゅういちにち ぶたにく ちゅうしゃ どう はやく りゅうがくせい あの さんじゅうにち いりぐち クラス サッカー かいがい けっこうです うき ちじん きゅうせん やまださん せいりです。 なにも かじ あける おしょうがつ いじわる(な) いつも ラーメン にせん おいしい ふしぎな シャワーをあびる まつ おてら たいへんな ～ばん どうぞ こくりつだいがく はつめい あう ごろごろする ゆうびんきょく たいへん（な） この きょうりょくな あに おにぎり きる かいぎ いちごうしゃ かいいん すてる おもしろい こども たんぼ やる にんき せがひくい らいにち ～まい ちいさい パーティー そう かれ ないか へや せいぶつがく せがたかい けいかく じゅうににち しょどう すいようび ジャーナリスト メール あまり にかげつまえ つまらない やきざかな いま じはつ ていしょく とけい みちのひだりがわ にじはん つき せん おじいさん かたいいいかた いちじ おんせん はいゆう かぶる はじめて シェフ ねこ あたらしい エジプト きょうし たぶん カフェ （～を）おねがいします （～を）ください しょじひん きたぐち あのう ～ぎょうめ すくない にぎやか（な） ははのひ まゆげ じゅうななふん あお しろくろのしゃしん おんなのこ ビール もちろん もうすぐ じゅういっさい しゃかい かえす しゅっしん はくし なんじ だいがくせい さらいねん せきどう する つち やめてください。 へんじ スペイン トイレ しょくじ あか あさごはん そして みっか ようじ こんど あかちゃん うちゅうひこうし おちゃ だいとうりょう スマホ ください ひょうし しがつ としうえ せなか きゅうり くがつ みちのみぎがわ おおむかし りょうきん のむ さいこう ドア いっかげつ でんしレンジ ときどき たいおんけい にじゅうさんにち",
              "decks": [
                {
                  "type": "normal",
                  "id": "genki1_1_en",
                  "name": "Genki vol. 1 Chapter 1 (Kana)",
                  "version": 1,
                  "deck_preview": "よんじ(ゅ)っさい さんじゅうごさい じ(ゅ)っさい じゅういっさい はたち／にじ(ゅ)っさい"
                },
                {
                  "type": "normal",
                  "id": "genki1_2_en",
                  "name": "Genki vol. 1 Chapter 2 (Kana)",
                  "version": 1,
                  "deck_preview": "きゅうまん はちまん よんまん ごまん ななまん"
                },
                {
                  "type": "normal",
                  "id": "genki1_3_en",
                  "name": "Genki vol. 1 Chapter 3 (Kana)",
                  "version": 1,
                  "deck_preview": "まるい こどものとき ひゃくえん えん えんだか"
                },
                {
                  "type": "normal",
                  "id": "genki1_4_en",
                  "name": "Genki vol. 1 Chapter 4 (Kana)",
                  "version": 1,
                  "deck_preview": "はんとし はんがく ちゅうがく さんじはん いちねんじゅう"
                },
                {
                  "type": "normal",
                  "id": "genki1_5_en",
                  "name": "Genki vol. 1 Chapter 5 (Kana)",
                  "version": 1,
                  "deck_preview": "いんしゅうんてん のむ しょくどう いく いちぎょうめ"
                },
                {
                  "type": "normal",
                  "id": "genki1_6_en",
                  "name": "Genki vol. 1 Chapter 6 (Kana)",
                  "version": 1,
                  "deck_preview": "かんこく こっかい そと がいこくじん かいがい"
                },
                {
                  "type": "normal",
                  "id": "genki1_7_en",
                  "name": "Genki vol. 1 Chapter 7 (Kana)",
                  "version": 1,
                  "deck_preview": "かえり ゆにゅう きたく いれる きこく"
                },
                {
                  "type": "normal",
                  "id": "genki1_8_en",
                  "name": "Genki vol. 1 Chapter 8 (Kana)",
                  "version": 1,
                  "deck_preview": "なんにん なんじ じかい なに もくじ"
                },
                {
                  "type": "normal",
                  "id": "genki1_9_en",
                  "name": "Genki vol. 1 Chapter 9 (Kana)",
                  "version": 1,
                  "deck_preview": "しりあい らいにち きます こない ちじん"
                },
                {
                  "type": "normal",
                  "id": "genki1_10_en",
                  "name": "Genki vol. 1 Chapter 10 (Kana)",
                  "version": 1,
                  "deck_preview": "きもち しょじひん まいあさ もってくる ちょうしょく"
                },
                {
                  "type": "normal",
                  "id": "genki1_11_en",
                  "name": "Genki vol. 1 Chapter 11 (Kana)",
                  "version": 1,
                  "deck_preview": "りょかん ゆうのうな ひとりたび りょけん きょうりょくな"
                },
                {
                  "type": "normal",
                  "id": "genki1_12_en",
                  "name": "Genki vol. 1 Chapter 12 (Kana)",
                  "version": 1,
                  "deck_preview": "あおぞら けしき とくしょく せいねん せきどう"
                }
              ]
            },
            {
              "id": "jlpt4_en",
              "course_name": "JLPT4",
              "preview": "文化 日本 明 日 本 英 語 映 画 車 勉 強 友達 店 銀行 会社 店員 駅 先生 週 休 図書館 電話 時間 天気",
              "required_decks": [
                "hiragana_en",
                "katakana_en"
              ],
              "decks": [
                {
                  "type": "normal",
                  "id": "jlpt4_1_en",
                  "name": "JLPT4 Chapter 1",
                  "version": 1,
                  "deck_preview": "文化 日本 明 日 本"
                }
              ]
            },
            {
              "id": "jlpt3_en",
              "course_name": "JLPT3",
              "preview": "会 話 毎 日 小 物 寺 観 光 通 う 考 事 直 進 や はし 何時 文化 会議 學ぶ 才能 計画 安全 方向 成功 問題 解決 日課 休憩",
              "required_decks": [
                "hiragana_en",
                "katakana_en"
              ],
              "decks": [
                {
                  "type": "normal",
                  "id": "jlpt3_1_en",
                  "name": "JLPT3 Chapter 1",
                  "version": 1,
                  "deck_preview": "会 話 毎 日 小"
                }
              ]
            },
            {
              "id": "jlpt2_en",
              "course_name": "JLPT2",
              "preview": "問題 単語 経験 外 国 方 法 知識 気持ち 注意 営業 問題 成果 成長 意見 情報 進展 意味 確認 改善 提案 安定 確信 構造 表現 理由",
              "required_decks": [
                "hiragana_en",
                "katakana_en"
              ],
              "decks": [
                {
                  "type": "normal",
                  "id": "jlpt2_1_en",
                  "name": "JLPT2 Chapter 1",
                  "version": 1,
                  "deck_preview": "問題 単語 経験 外 国"
                }
              ]
            },
            {
              "id": "jlpt1_en",
              "course_name": "JLPT1",
              "preview": "漢字 学 習 慣 法 応 用 理解 生活 通じる 職業 認識 研究 批判 理論 効果 発表 対策 詳細 専門 経験 提案 責任 思考 計算 合格 仕事 自由",
              "required_decks": [
                "hiragana_en",
                "katakana_en"
              ],
              "decks": [
                {
                  "type": "normal",
                  "id": "jlpt1_1_en",
                  "name": "JLPT1 Chapter 1",
                  "version": 1,
                  "deck_preview": "漢字 学 習 慣 法"
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}